{"data":{"allContentfulPost":{"edges":[{"node":{"title":"Is cyber insurance worth it?","slug":"is-cyber-insurance-worth-it","excerpt":{"excerpt":"Cyber insurance can help protect your business from the emerging threat of online crime. Is it worth buying? Realise the full value of this insurance here."},"content":{"content":"Cyber insurance is an emerging form of insurance which aims to protect business owners from the growing threat of online crime, data breaches, and issues and losses caused by compromised IT security. But is it worth the cost? We explore the costs involved, and the level of protection offered.\n## The value of cyber insurance\nAs with any form of insurance, peace of mind is almost priceless. \n\nFor the SME owner or busy entrepreneur, could your business survive following not just operational losses in terms of time and resource but also the potential fines incurred, lost revenue due to downtime, and damage to customer trust due to such threats?\n\nWith new limits around GDPR meaning businesses can be hit with fines of up to £20m, or 4% of annual turnover (which ever is the greatest), can you afford to gamble?\n## The cost of a cyber attack on your business\nCyber Insurer UK is a specialist insurance company which aims to make it as easy as possible for SME owners and entrepreneurs to achieve peace of mind through a great value, easy to understand policy which is tailored to provide a level of cover relevant to your business.\n\nEarlier this year, law firm DLA Piper found that the UK has reported the third highest number of breaches (around 11,000), trailing only the Netherlands and Germany. In the nine months following the introduction of GDPR, around 60,000 data breaches have been reported. \n\nThe total of 91 fines already imposed have varied from thousands to millions of pounds. \n\n## What types of things does cyber insurance protect from?\nCyber crime is a detailed and complex subject, but we’ve broken down the most common types of attack below. \n### Loss/damage to electronic data\nThe cost of data recovery, as a result of compromised hardware or software, and destruction of records, for example.\n### Online media cover\nRelating to defacement of online assets/websites, or IP infringement relating to a breach.\n### Business Interuption\nLoss of income or incurred expenses due to downtime.\n### Cyber Extortion\nExper advice and support if you become victim to ransomeware locking you out of your IT systems.\n### Cost of notifying the ICO\nCrucially, including any associated legal costs with regards to determining whether notification is necessary.\n### Crisis management\nMarketing to customers following a data breach can be costly. Our policies cover the cost to you of marketing/promotion & PR to customers following a breach.\n### Further Liabilities\nIncluding, network security (for example lawsuits relating to hacking, malware etc. of your own networks), privacy (lost/made public personal data such as national insurance numbers), and libel, defamation or slander.\n\nIf you’d like more information, see our post on ‘what does cyber insurance cover’ (need to link).\n## Get covered today\nGetting covered  from Cyber Insurer takes just a few minutes and can give you the ultimate peace of mind that your business is protected. With cover starting from as little than £37.99 per month, ensure your business is covered."},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/1x10xh68TUOt4xnwF7DRMk/463935e5aac2ebad0fed832d897f4a43/hacker-1944688_1280.jpg","fileName":"hacker-1944688_1280.jpg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"is-cyber-insurance-worth-it","id":"0a0b4419-fc4e-53d8-acca-623cff73fa90"}}