{"data":{"page":{"id":"ddffb1cb-7eea-5f04-bd32-a70168184691","html":"<p>This privacy policy applies between you, the User of this Website and CyberInsUK LTD, the owner and provider of this Website. CyberInsUK LTD takes the privacy of your information very seriously. This privacy policy applies to our use of any and all Data collected by us or provided by you in relation to your use of the Website.</p>\n<p><strong>Please read this privacy policy carefully</strong>.</p>\n<h2><strong>Definitions and interpretation</strong></h2>\n<ol>\n<li>In this privacy policy, the following definitions are used:</li>\n</ol>\n<table>\n<tr>\n<td>\n<strong>Data</strong>\n</td>\n<td>\ncollectively all information that you submit to CyberInsUK LTD via the Website. This definition incorporates, where applicable, the definitions provided in the Data Protection Laws;\n</td>\n</tr>\n<tr>\n<td>\n<strong>Data Protection Laws</strong>\n</td>\n<td>\nany applicable law relating to the processing of personal Data, including but not limited to the Directive 96/46/EC (Data Protection Directive) or the GDPR, and any national implementing laws, regulations and secondary legislation, for as long as the GDPR is effective in the UK;\n</td>\n</tr>\n<tr>\n<td>\n<strong>GDPR</strong>\n</td>\n<td>\nthe General Data Protection Regulation (EU) 2016/679;\n</td>\n</tr>\n<tr>\n<td>\n<strong>CyberInsUK LTD,</strong> or <strong>us</strong>\n</td>\n<td>\nCyberInsUK LTD, a company incorporated in England and Wales with registered number 11458333 whose registered office is at 14 Beatty Avenue, Newcastle upon Tyne, Tyne & Wear, NE2 3QP;\n</td>\n</tr>\n<tr>\n<td>\n<strong>User</strong> or <strong>you</strong>\n</td>\n<td>\nany third party that accesses the Website and is not either (i) employed by CyberInsUK LTD and acting in the course of their employment or (ii) engaged as a consultant or otherwise providing services to CyberInsUK LTD and accessing the Website in connection with the provision of such services; and\n</td>\n</tr>\n<tr>\n<td>\n<strong>Website</strong>\n</td>\n<td>\nthe website that you are currently using, www.cyberinsurer.uk, and any sub-domains of this site unless expressly excluded by their own terms and conditions.\n</td>\n</tr>\n</table>\n<ol start=\"2\">\n<li>In this privacy policy, unless the context requires a different interpretation:</li>\n</ol>\n<p>a. the singular includes the plural and vice versa;</p>\n<p>b. references to sub-clauses, clauses, schedules or appendices are to sub-clauses, clauses, schedules or appendices of this privacy policy;</p>\n<p>c. a reference to a person includes firms, companies, government entities, trusts and partnerships;</p>\n<p>d. “including” is understood to mean “including without limitation”;</p>\n<p>e. reference to any statutory provision includes any modification or amendment of it;</p>\n<p>f. the headings and sub-headings do not form part of this privacy policy.</p>\n<h2><strong>Scope of this privacy policy</strong></h2>\n<ol start=\"3\">\n<li>This privacy policy applies only to the actions of CyberInsUK LTD and Users with respect to this Website. It does not extend to any websites that can be accessed from this Website including, but not limited to, any links we may provide to social media websites.</li>\n</ol>\n<ol start=\"4\">\n<li>For purposes of the applicable Data Protection Laws, CyberInsUK LTD is the “data controller”. This means that CyberInsUK LTD determines the purposes for which, and the manner in which, your Data is processed.</li>\n</ol>\n<h2><strong>How we collect Data</strong></h2>\n<ol start=\"5\">\n<li>We collect Data in the following ways:</li>\n</ol>\n<p>a. data is given to us by you; and</p>\n<p>b. data is collected automatically.</p>\n<h2><strong>Data that is given to us by you</strong></h2>\n<ol start=\"6\">\n<li>CyberInsUK LTD will collect your Data in a number of ways, for example:</li>\n</ol>\n<p>a. when you contact us through the Website, by telephone, post, e-mail or through any other means; in each case, in accordance with this privacy policy.</p>\n<h2><strong>Data that is collected automatically</strong></h2>\n<ol start=\"7\">\n<li>To the extent that you access the Website, we will collect your Data automatically, for example:</li>\n</ol>\n<p>a. we automatically collect some information about your visit to the Website. This information helps us to make improvements to Website content and navigation, and includes your IP address, the date, times and frequency with which you access the Website and the way you use and interact with its content.</p>\n<h2><strong>Keeping Data secure</strong></h2>\n<ol start=\"8\">\n<li>We will use technical and organisational measures to safeguard your Data, for example:</li>\n</ol>\n<p>a. access to your account is controlled by a password and a user name that is unique to you.</p>\n<p>b. we store your Data on secure servers.</p>\n<ol start=\"9\">\n<li>\n<p>Technical and organisational measures include measures to deal with any suspected data breach. If you suspect any misuse or loss or unauthorised access to your Data, please let us know immediately by contacting us via this e-mail address: paul@cyberinsurer.uk.</p>\n</li>\n<li>\n<p>If you want detailed information from Get Safe Online on how to protect your information and your computers and devices against fraud, identity theft, viruses and many other online problems, please visit www.getsafeonline.org. Get Safe Online is supported by HM Government and leading businesses.</p>\n</li>\n</ol>\n<h2><strong>Data retention</strong></h2>\n<ol start=\"11\">\n<li>\n<p>Unless a longer retention period is required or permitted by law, we will only hold your Data on our systems for the period necessary to fulfil the purposes outlined in this privacy policy or until you request that the Data be deleted.</p>\n</li>\n<li>\n<p>Even if we delete your Data, it may persist on backup or archival media for legal, tax or regulatory purposes.</p>\n</li>\n</ol>\n<h2><strong>Your rights</strong></h2>\n<ol start=\"13\">\n<li>You have the following rights in relation to your Data:</li>\n</ol>\n<p>a. <strong>Right to access</strong> - the right to request (i) copies of the information we hold about you at any time, or (ii) that we modify, update or delete such information. If we provide you with access to the information we hold about you, we will not charge you for this, unless your request is “manifestly unfounded or excessive.” Where we are legally permitted to do so, we may refuse your request. If we refuse your request, we will tell you the reasons why.</p>\n<p>b. <strong>Right to correct</strong> - the right to have your Data rectified if it is inaccurate or incomplete.</p>\n<p>c. <strong>Right to erase</strong> - the right to request that we delete or remove your Data from our systems.</p>\n<p>d. <strong>Right to restrict our use of your Data</strong> - the right to “block” us from using your Data or limit the way in which we can use it.</p>\n<p>e. <strong>Right to data portability</strong> - the right to request that we move, copy or transfer your Data.</p>\n<p>f. <strong>Right to object</strong> - the right to object to our use of your Data including where we use it for our legitimate interests.</p>\n<ol start=\"14\">\n<li>\n<p>To make enquiries, exercise any of your rights set out above, or withdraw your consent to the processing of your Data (where consent is our legal basis for processing your Data), please contact us via this e-mail address: paul@cyberinsurer.uk.</p>\n</li>\n<li>\n<p>If you are not satisfied with the way a complaint you make in relation to your Data is handled by us, you may be able to refer your complaint to the relevant data protection authority. For the UK, this is the Information Commissioner’s Office (ICO). The ICO’s contact details can be found on their website at <a href=\"https://ico.org.uk/\">https://ico.org.uk/</a>.</p>\n</li>\n<li>\n<p>It is important that the Data we hold about you is accurate and current. Please keep us informed if your Data changes during the period for which we hold it.</p>\n</li>\n</ol>\n<h2><strong>Links to other websites</strong></h2>\n<ol start=\"17\">\n<li>This Website may, from time to time, provide links to other websites. We have no control over such websites and are not responsible for the content of these websites. This privacy policy does not extend to your use of such websites. You are advised to read the privacy policy or statement of other websites prior to using them.</li>\n</ol>\n<h2><strong>Changes of business ownership and control</strong></h2>\n<ol start=\"18\">\n<li>\n<p>CyberInsUK LTD may, from time to time, expand or reduce our business and this may involve the sale and/or the transfer of control of all or part of CyberInsUK LTD. Data provided by Users will, where it is relevant to any part of our business so transferred, be transferred along with that part and the new owner or newly controlling party will, under the terms of this privacy policy, be permitted to use the Data for the purposes for which it was originally supplied to us.</p>\n</li>\n<li>\n<p>We may also disclose Data to a prospective purchaser of our business or any part of it.</p>\n</li>\n<li>\n<p>In the above instances, we will take steps with the aim of ensuring your privacy is protected.</p>\n</li>\n</ol>\n<h2><strong>General</strong></h2>\n<ol start=\"21\">\n<li>\n<p>You may not transfer any of your rights under this privacy policy to any other person. We may transfer our rights under this privacy policy where we reasonably believe your rights will not be affected.</p>\n</li>\n<li>\n<p>If any court or competent authority finds that any provision of this privacy policy (or part of any provision) is invalid, illegal or unenforceable, that provision or part-provision will, to the extent required, be deemed to be deleted, and the validity and enforceability of the other provisions of this privacy policy will not be affected.</p>\n</li>\n<li>\n<p>Unless otherwise agreed, no delay, act or omission by a party in exercising any right or remedy will be deemed a waiver of that, or any other, right or remedy.</p>\n</li>\n<li>\n<p>This Agreement will be governed by and interpreted according to the law of England and Wales. All disputes arising under the Agreement will be subject to the exclusive jurisdiction of the English and Welsh courts.</p>\n</li>\n</ol>\n<h2><strong>Changes to this privacy policy</strong></h2>\n<ol start=\"25\">\n<li>CyberInsUK LTD reserves the right to change this privacy policy as we may deem necessary from time to time or as may be required by law. Any changes will be immediately posted on the Website and you are deemed to have accepted the terms of the privacy policy on your first use of the Website following the alterations.</li>\n</ol>\n<p>You may contact CyberInsUK LTD by email at paul@cyberinsurer.uk.</p>","frontmatter":{"title":"Privacy Policy"}}},"pageContext":{"slug":"/privacy/","source":"pages"}}