{"data":{"allContentfulPost":{"edges":[{"node":{"title":"Cyber Insurer UK partners with A+ Rated Global Insurance Group QBE","slug":"cyber-insurer-uk-partners-with-a-rated-global-insurance-group-qbe","excerpt":{"excerpt":"We've teamed up with QBE to help provide an innovative cyber insurance policy to protect micro and small businesses from the growing threat of cyber attacks."},"content":{"content":"# We've partnered with QBE to launch our easy-to-buy cyber insurance for small and micro businesses.\n\nSmaller businesses in the UK are increasingly a target for cyber crime and are just as exposed to the rules of GDPR as their larger counterparts.  We've teamed up with QBE, the business insurance specialist, to provide a dedicated cyber insurance product for small and micro businesses that is affordable, quick and easy to understand.\n\nThere are common misconceptions about the exposure a small business can have to cyber-attacks, with many small business owners believing that only those that accept payment for goods or services online are at risk.  Small companies of all types however are increasingly falling victim to cyber criminals; one company which had an attack that resulted in hundreds of phishing emails being sent from a hacked mailbox to their clients had to spend £32,500 on legal and IT forensic fees to ensure the hacker was out of their system.  Furthermore, they were obliged to notify the Data Protection Regulator of the event.\n\nCyber Insurer UK are providing online cyber and data breach cover for UK businesses with less than £2.5m of annual turnover, which provides financial and practical support to policyholders in the event of a cyber attack, being held to ransom by hackers and in the face of falling foul of GDPR. CyberInsurerUK uses ‘chat bot’ technology and artificial intelligence to gather and verify customer information, so that it can offer cover faster than anyone else in the small business space. \n\nCyberInsurerUK can get a customer a price in under two minutes and have them covered in under five. \nWith the backing of QBE, CyberInsurerUK can cover businesses with up to £2.5m of annual turnover, which is a 25% higher limit than what is currently available on the market. The cover is of a superior level, paid for monthly with no credit fees and delivered 100% online. \n\nPaul Callaghan, Founder, CyberInsurerUK said: “CyberInsurerUK was setup to save time for busy people running fast moving businesses. We do this by providing quick, easy to understand, fair and affordable Cyber & Data Breach Insurance so our customers can focus on growing their business, not filling out forms. \n\nErica Constance, Cyber Portfolio Manager, QBE Europe, said: “Having cyber cover in place is getting more and more important for all types of businesses. Micro companies face the same exposures to \ncyber risks as larger companies but purchasing a specialist insurance product can often be overly complicated for these smaller companies. This partnership aims to provide a more accessible option for our customers.”\n\nWhile this insurance will provide vital protection and support to companies in the event of a breach, there are five simple ways a small business owner can ensure their defences are robust:\n1.\tInstall software updates as soon as they are released\n2.\tPeriodically back up data on an external disk drive\n3.\tInstall two-factor authentication on email and other online accounts \n4.\tBefore clicking on a link or attachment on an email verify the email address is correct. \n5.\tIf a supplier changes their bank account number, verify their new details over the phone. \n\nFor more cyber security tips, check the government National Cyber Security Centre website:  [https://www.ncsc.gov.uk/section/information-for/small-medium-sized-organisations](https://www.ncsc.gov.uk/section/information-for/small-medium-sized-organisations)\n\nFor more information contact:\n\n__Cyber Insurer__\n- Georgina Phillips, Media Relations Advisor, CyberInsurerUK, +44 0191 375 8788\n\n__QBE Europe__\n- Alexis Burris, Media Relations Adviser, QBE, +44 (0)20 3465 3921\n- Sandra Villanueva, Senior Media Relations Manager, QBE +44(0)20 7105 5284\n\n### About Cyber Insurer UK\nCyberInsurerUK is an insurance intermediary, regulated and authorised by the Financial Conduct Authority. Our focus is to protect small businesses and make the process of buying Cyber & Data Breach Insurance, easy, quick and affordable with complete transparency. Our mission is to protect entrepreneurs. They risk a lot to build great companies and create jobs and wealth, so we want to give them one less thing to worry about.\n\n### About QBE \nQBE European Operations is part of QBE Insurance Group, one of the world’s leading international insurers and reinsurers and Standard & Poor’s A+ rated. Listed on the Australian Securities Exchange, QBE’s gross written premium for the year ended 31 December 2018, was US$13.7 billion.\nAs a business insurance specialist, QBE European Operations offers a range of insurance products from the standard suite of property, casualty and motor to the specialist financial lines, marine and energy. All are tailored to the individual needs of our small, medium and large client base.\n"},"cover":null}}]}},"pageContext":{"slug":"cyber-insurer-uk-partners-with-a-rated-global-insurance-group-qbe","id":"dff84d93-d031-531e-92f2-059638670eff"}}