{"data":{"allContentfulPost":{"edges":[{"node":{"title":"Cyber insurance & GDPR","slug":"cyber-insurance-and-gdpr","excerpt":{"excerpt":"The regulations around GDPR make cyber insurance an even more crucial product to protect your business. Find out more here."},"content":{"content":"Replacing the outdated Data Protection Act 2008, the General Data Protection Regulations (GDPR) has been the biggest shakeup with regards to processing personal data in the 21st Century.\n\nFor many entrepreneurs and small business owners, it is yet another “thing to worry about”, with a long list of legal requirements to now abide to, as well as the increased responsibility should a data breach occur. \n\nOne of the biggest changes is that businesses can now be fined up to 4% of their annual turnover, or up to €20million. For an SME or startup business, such a fine would likely be crippling.\n## What is GDPR insurance?\nAs a small business owner, your time is precious and worrying about data breaches shouldn’t eat into your day.\n\nGDPR insurance can protect your business in the event of a data breach or other non-compliance with GDPR. \n\nGDPR insurance from Cyber Insurer UK can cover your business for up to £XXXXXXX, ensuring peace of mind, should the worst happen. \n\nAlways bear in mind that GDPR insurance __does not offer an alternative to robust security and compliance measures__, merely supplementing the best practice you should have within your business at all times.\n## GDPR insurance guide\nEven for those who have sought legal advice on GDPR, it is still a logistical and technical minefield to ensure constant compliance. \n\nLook for an insurance company who specialises in cyber crime and GDPR, compared to business or third-party liability insurance providers who may sell GDPR insurance as an ‘add-on’ product.\n\nCyber Insurer UK specialises in GDPR insurance for entrepreneurs and SME owners, understanding your needs, and offering affordable, modern cover for innovative business owners. We know the challenges you face and have made our product streamlined and effortless, from the moment you get a quote to getting in touch with our claims or support teams.\n## GDPR insurance checklist/requirements\nIf you’re unsure whether your business is compliant with GDPR, a quick audit against the official guidelines should help you get a better idea. It often makes sense to seek legal advice on the matter, but for the GDPR newcomer, we’ve put together some brief pointers:\n### Personal data breach liability\n“A breach of security leading to the accidental or unlawful destruction, loss, alteration, unauthorized disclosure of, or access to, personal data”. The main aim of GDPR is “to protect and empower data privacy”, particularly with regards to the way businesses uses personal data, and with data breaches becoming ever more common, is your business’s cyber security up to scratch, as well as your staff’s knowledge on data storage, usage, and processing?\n\n### The right to be forgotten\nGDPR encourages data minimisation, so individuals have the right for their data to be removed at any time, and completely removed in all its uses. Can your business piece together an individual's data, especially if shared across multiple systems and databases?\n### Customer consent\nOne of the underpinning principles of GDPR is that customer consent is sought, and stored. This extends to how long, and for what purpose data is used for, and individual have the right to request all data stored upon them. Can your business confidently do this?\n### Data Protection Officer (DPO)\nGDPR stipulates that businesses with more than fifteen employees should appoint a DPO to regularly monitor and process any data held, and be a point of call should an incident occur. Does your business have an appointed DPO?\n### 72 hour rule for notification\nIn the event of a data breach, GDPR enforces that business notify local authorities within 72 hours of the breach. First and foremost, would your business even be aware of a breach within strict timescales?\n## Protect your business against the threat of GDPR today\nAlthough GDPR has been in place for a while now, the risks which all business face remain as important now as they did when GDPR first launched. With potentially business-destroying fines for non-compliance, don’t let your company be made an example of.\n\nGet peace of mine by getting a quote for GDPR insurance today to make sure your business is protected.\n\n[CTA: Get a quote today] \n\n"},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/78aiLjZDSMCf5vUtwtrxXd/d9ae1a08f35b7be23e55eb1a81506dd6/credit-card-1591492_1920.jpg","fileName":"credit-card-1591492_1920.jpg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"cyber-insurance-and-gdpr","id":"1ea4167a-3a53-53e7-ad48-d8391c056cfa"}}