{"data":{"allContentfulPost":{"edges":[{"node":{"title":"How to avoid ransomware attacks","slug":"how-to-avoid-ransomware-attacks","excerpt":{"excerpt":"Ransomware attacks are scary for any business owner to contend with, but with a little effort, the risk can be minimised. Find out more here."},"content":{"content":"# How to avoid ransomware attacks\n\nRansomware refers to malicious software that uses encryption to deny you access to your data. Cyber criminals often then extort money from you as ransom with promises of restoring your data (though of course, this is never guaranteed so responding to ransomware attacks should generally be a last resort). Typically, ransomware makes way into computers through links and email attachments - i.e. human error. While the best way to protect against ransomware is often employee training and vigilance, here are some ways you can protect yourself from falling victim to a ransomware attack.\n\n## 1. Install security/antivirus software (and use it!) \n\nTo protect your computer and data from ransomware attacks, you need security software, be it antivirus, dedicated malware protection, or more secure firewall. These also tend to protect your computer from malicious malware and ransomware. SOftware packages are generally a first line of defense, and should be able to sense hidden threats and offer adequate protection.\nRegular scans are good for your network security as it identifies threats that may be hidden from real time detection. Always ensure your security software is updated so that you are using the latest versions with improved security features. \n\n## 2. Ensure a solid backup plan is in place\n\nIt may seem obvious but not everyone has their data backed up. Backing up your data eliminates your attackers’ power, reduces the effects of a malware attack and makes it easy to repair your systems. Back up your most important data both on cloud and hard drive, stored externally so that you can easily access it in case your network security is breached.\nYou should also have a recovery plan that allows for immediate restoration when your network security is compromised. For any small business owner relying on online systems for the smooth running operation of the business, a robust back up plan is essential.\n\n## 3. Keep software and operating systems updated\n\nUsing older versions of software and operating systems make computers targets for ransomware attacks. This is because malicious malware often takes advantage of security loopholes in archaic versions to infiltrate computers.\nUpdates always come with patches to remedy vulnerabilities that can be used by cybercriminals. You can enable automatic updates so that you don’t risk forgetting. Other than protecting your data, updated systems also generally improve how your network will function, no matter if it’s Mac OS or Windows, or another operating system. \n\n## 4. Be more cautious online\n\nRansomware usually gets into computers through email attachments and files that you are tricked to download when you click on malicious links. To avoid putting your network security at risk, you should be vigilant online. Offer employees training on how to spot suspicious links, and ensure that any that are received are reported correctly. \nAvoid clicking on unknown links or downloading email attachments from unfamiliar sources. You can set up your email to reject unfamiliar addresses and emails with executable attachments which tend to be the most problematic. It also helps to ensure extension visibility so you can avoid downloading dangerous files.\n\n## What to do if you experience a ransomware attack\n\nIf you establish that your computers have been infected, you should identify the type and source of infection. You should then go offline to prevent the infection from spreading to connected devices before getting clearing the infection and restoring your data.\nIt may be tempting to pay the ransom, but you are advised not to as there are no guarantees and you will only be funding the attackers. However, if it is the only option, first negotiate for a lower price. You can also just wipe out everything and reinstall your operating system if you are not keen on going through the whole process.\nIf you are unlucky enough to fall victim to a ransomware attack, one way to mitigate the damage is to ensure you have an adequate cyber insurance policy in place, in order to get your business up and running again quickly, as well as minimise any downtime. [Get a quote with Cyber Insurer UK today](https://my.cyberinsurer.uk/quote) in as little as 5 minutes and have ‘one less thing to worry about’ when it comes to your businesses networking policies.\n"},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/X5wyaC177PnlVP6bHFu9u/4e06a8f9a32bc1747034253379daa2a7/michael-geiger-JJPqavJBy_k-unsplash.jpg","fileName":"michael-geiger-JJPqavJBy_k-unsplash.jpg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"how-to-avoid-ransomware-attacks","id":"af7e79e7-c94a-568e-a3af-96946cc7eb8c"}}