{"data":{"allContentfulPost":{"edges":[{"node":{"title":"Do I need cyber insurance?","slug":"do-i-need-cyber-insurance","excerpt":{"excerpt":"Not just another type of insurance, cyber insurance protects you and your business from modern day threats. Do you need cyber insurance? Find out here."},"content":{"content":"When researching cyber security, and reading about mass-scale cyber attacks in the press, it’s easy to have the mindset of “it won’t happen to my business”.\nHowever, a recent study by the government found that almost half of UK businesses had been affected by cyber crime, with the average cost of an attack or data breach running close to £75,000.\n\n## Most common types of attacks\n\nThe most common type of cyber attack involves fraudulent emails, with the survey [2018 Cyber Security Breaches Survey] finding that that loss of files or data, software corruption, and theft of money, assets, or intellectual property were the most common result of such attacks.\n\nIt’s headline news. And it’s businesses of all sizes. From data-led startups (everyone has heard the expression ‘data is the new oil’), to global orgnaisations, data breaches and data loss are now frequently making international news. The WannaCry malware, for example, affected computers across the world including the UK’s very own NHS systems. The cost of this breach to the NHS has been [estimated to be £92 million](https://www.digitalhealth.net/2018/10/dhsc-puts-cost-wannacry-nhs-92m/).\n\nAnd while the NHS and government might be popular targets for cyber criminals, smaller businesses, who might have more lax security policies, are much softer targets.  Among SMEs and entrepreneurial businesses, certain types of business that are more susceptible to attack.\n\n[Healthcare and financial services companies top the list](http://www.infoguardsecurity.com/5-industries-top-hit-list-cyber-criminals-2017/), with manufacturing, government, and legal next. The 2017 X-Force Threat Intelligence Index states that financial services were the most-attacked, with the method of attack being primarily through insider attacks.\n\nAmong entrepreneurs and SMEs, credit card fraud has become easier, particularly among non-savvy, as well as ecommerce platforms, which are a natural target for hackers. Business with distributed infrastructure & cloud computing are also expected to see a rise in attacks [2017 X-Force Threat Intelligence Index].\n\n## Do I need cyber insurance?\n\nDon’t allow your business to be the latest in 2019’s [list of major data breaches](https://www.aba.com/Tools/Function/Documents/2016Cyber-Insurance-Buying-Guide_FINAL.pdf).\n\nGet a quote for cyber insurance today. With policies starting from £29.99, you might be surprised at how much cover you receive.\n\nIf you’re still unsure, the key questions to ask yourself are:\n\n- Does your business have a chief information security officer?\n- What (if any) security software and policies does your business have in place, and how well are you equipped to cope in the event of a breach or attack?\n- What customer data are you collecting? How is it stored? How is it processed? Is there any risk for data being lost, abused, exposed, or altered?\n- Is physical access to data, computers, and even offices tightly controlled? Can users leave passwords lying around, or leave laptops on trains?\n- What is your data backup policy? Does your business audit its data, its processes, and its staff on a regular basis?\n\nIf you’re unsure, or can’t answer any of the above questions, could your business cope with a data breach or cyber attack?\n\nIt’s important to remember that cyber insurance is not a replacement for a properly thought out cyber security policy. By tackling all of the above in a positive manner, you can do a lot to protect your business, however cyber criminals are almost always one step ahead of the game. \n\n## Get covered in minutes today\n\nBeing at all uncertain about needing cyber insurance means that you need cyber insurance. Get a quote from Cyber Insurer today and get covered in just a few minutes for less than you think.\n"},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/2NTHpou3s48AkUaewi42Q6/6a951ddc21f9f24282ca4e848065593e/photo-1490474418585-ba9bad8fd0ea.jpg","fileName":"photo-1490474418585-ba9bad8fd0ea.jpg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"do-i-need-cyber-insurance","id":"d19f9af1-4321-5ccd-9bb9-6f05b326317e"}}