{"data":{"allContentfulPost":{"edges":[{"node":{"title":"Is cyber insurance worth it?","slug":"is-cyber-insurance-worth-it","excerpt":{"excerpt":"Cyber insurance can help protect your business from the emerging threat of online crime. Is it worth buying? Realise the full value of this insurance here."},"content":{"content":"Cyber insurance is an emerging form of insurance which aims to protect business owners from the growing threat of online crime, data breaches and losses caused by compromised IT security. But is it worth the cost? We explore the costs involved, and the level of protection offered.\n\n## The value of cyber insurance\nAs with any form of insurance, peace of mind is almost priceless. \n\nFor the SME owner or busy entrepreneur, could your business survive following not just operational losses in terms of time and resource,but also the potential fines incurred, lost revenue due to downtime and damage to customer trust due to such threats?\n\n## The cost of a cyber attack on your business\nCyber Insurer UK is a specialist insurance company which aims to make it as easy as possible for SME owners and entrepreneurs to achieve peace of mind through a great value, easy to understand policy which is tailored to provide a level of cover relevant to your business.\n\nThe iontroduction of GDPR means businesses can be hit with fines of up to £20m, or 4% of annual turnover (which ever is the greatest), can you afford to gamble?\n\nA cyber attack may result in fines from regulators, compensation payouts to your clients, business interruption leading to lost revenues and most importantly for small, growing businesses, reputational damage. \n\n## What types of things does cyber insurance protect from?\nBelow are the most common ways in which companiescan suffer as a result of cyber crime.\n### Loss/damage to electronic data\nMalware can compromise hardware or software, and destruct your data.\n### Online media cover\nOnline assets/websites can be defaced resulting in potential infringement of intellectual property.\n### Business Interuption\nWithout a fully functioning network continuing your operations may not be possible and work arounds may result in extra costs.\n### Cyber Extortion\nIt has become very common for ransomware to lock companies out of their compouter systmens or threaten to post third party confidential information online.\n### Notifying the ICO\nBeing the victim of a cyber criminal stealing your client's data from your IT network can get you into hit water with the ICO resulting in a comprehensive investigation and possible fines.\n### Reputational Harm\nFailing to safeguard your client's datacan result in damage to your reputation.\n### Further Liabilities\nLawsuits relating ti hacking, of your own networks or sensitive databeing made public or even libel, defamation or slander.\n## Get covered today\nGetting covered  from Cyber Insurer UK takes just a few minutes and can give you the ultimate peace of mind that your business is protected. With cover starting from as little than £37.99 per month, ensure your business is covered."},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/1x10xh68TUOt4xnwF7DRMk/463935e5aac2ebad0fed832d897f4a43/hacker-1944688_1280.jpg","fileName":"hacker-1944688_1280.jpg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"is-cyber-insurance-worth-it","id":"0a0b4419-fc4e-53d8-acca-623cff73fa90"}}