{"data":{"allContentfulPost":{"edges":[{"node":{"title":"What to do after a data breach","slug":"what-to-do-after-a-data-breach","excerpt":{"excerpt":"Discovering a data breach is a troublesome time for any business owner, but by having a plan, downtime and further disruption can be minimised. Read our helpful 8-step plan here."},"content":{"content":"If you have become aware that a data breach has happened within your business, it can be a stressful time. It can however, be dealt with. \n\nWith honesty, transparency, and knowing the relevant steps to take, the impact of a data breach on your operations can be minimised. We’ve documented a quick plan of action if you suspect that a data breach or other similar cyber crime has occured, however, your first step should be to [get a quote for cyber insurance](https://my.cyberinsurer.uk/quote) from Cyber Insurer.  \n## Document everything you do\nWhile any data breach is undoubtedly a stressful time, making a comprehensive log of all the actions which you and your colleagues/staff take next is crucial in keeping a log that you acted in a correct and lawful manner. It can also be useful to refer to in the event of a further breach, or to ascertain what might have initially caused the incident.\n## Ensure any breach has actually stopped\nOnce the compromise has been determined, its critically important to plug the hole and ensure that any additional data is not leaked or further damage is caused. This will involve getting to the root cause - be it a rogue USB drive, a weak password, employee malpractice or other means. Once the source of the breach has been determined, and stopped, the investigation and reparation can begin.\n## Determine the scale and scope of any assets which are known to have been compromised\nTo make sure your claim is processed as quickly as possible, and minimise further potential damage, it’s important to get a handle on what data has been compromised.\n\nMake a list (if known) of any accounts which may have led to the breach, as well as any specific data (if known). In the case of customer data, try to ascertain the number of records affected, which fields might have been compromised, and any additional damage or data loss which might have occured (or could still occur) as part of the breach.\n## Reset all relevant passwords and logins\nHowever the breach has occured, it’s important to ensure that any further damage cannot be done. Change the password, and if necessary, any attached email addresses to the system(s) that were compromised. Some applications allow you to “log out of all other sessions” which can also be helpful if unauthorised access has occurred.\n\nNow is a good time to create a stronger, more secure password. If additional security such as two-factor authorisation can be used, enable it. A password manager can also be a useful means of storing high-strength passwords.\n\nIf a password has been used for multiple sites or applications, you could still be at risk. To mitigate the risk of this, change any passwords which you know to be used multiple times, and any high-risk websites or applications, such as banking, email, or social media.\n## Ensure your Data Protection Officer (and other relevant staff) are notified.\nYour Data Protection Officer should ensure that compliance is met in line with GDPR and any other applicable laws. Whether this means coordinating with the ICO to inform the regulator of the breach, or to act as a point of contact from customers or those that have had data or PII compromised, it’s important to follow the guidelines and do your lawful best.\n\nYour tech team should carry out further investigation into the breach, and determine whether further security measures need to be implemented.\n## Contact the relevant institution(s)\nIt can be helpful to contact the organisations involved, particularly financial institutions, who can flag any further suspicious activity on the account(s) you mention. \n\nThe organisation might also be able to shed further light on the breach, potentially offering a level of detail such as IP addresses, and additional communication details, which you might not otherwise be able to access.\n## Monitor the situation closely following the breach\nIt makes sense to keep a close watch on any affected account(s) following any data breach.\n\nSeek third-party support from an IT/OpSec consultant and advice from an external/impartial source. If internal processes need to be reviewed and amended following a breach, then they should be done immediately to prevent further attacks.\n## Prepare an apology and explore compensatory measures\nIf the breach has affected your customers,  it’s important to let them know what has happened, and keep them updated as investigations continue. The situation is best handled with honesty and transparency. Having a detailed log of what has happened will help.\n\nIt can also be worth preparing some kind of offer for customers to try to retain trust, and consider any wider implications of negative public relations which may surround the breach.\n\nBeing victim to cyber crime or a data breach is demanding to businesses of any size, but can be crippling to entrepreneurs or SMEs. \n\n[__Ensure you’re covered from a financial perspective by getting a quote from Cyber Insurer today. \n__](https://my.cyberinsurer.uk/quote)"},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/41fVhI58aGycdA23bWwZ6p/3ae9c74210acce241558b23807bf7f9a/helloquence-5fNmWej4tAA-unsplash.jpg","fileName":"helloquence-5fNmWej4tAA-unsplash.jpg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"what-to-do-after-a-data-breach","id":"363940bf-3c25-53ad-af51-ad82a7c72b3b"}}