{"data":{"allContentfulPost":{"edges":[{"node":{"title":"How much does cyber insurance cost?","slug":"how-much-does-cyber-insurance-cost","excerpt":{"excerpt":"If you've been thinking about cyber insurance but are unsure of the cost, check out our guide which explains - it might be cheaper than you think."},"content":{"content":"With cyber crime a hot topic in national and international news this year, business owners of all sizes are waking up to the financial implications that a data breach, or other cyber attack could cost.\n\nCyber insurance now exists to protect SMEs from these types of attack, but how much does cyber insurance cost? Cyber Insurer UK offers an innovative policy to cover your business, and to ensure that your business is safe from the ramifications of a cyber attack or data breach, we’ve broken down the costs involved.\n\n## The cost of a cyber attack on your business\n\nThe average cost of a data breach to an SME is estimated to be £75k ([source](https://www.gov.uk/government/news/government-urges-business-to-take-action-as-cost-of-cyber-security-breaches-doubles)). \n\nThe cost of our policies starts at £37.63 per month. Can your business afford to take the risk?\n\nCyber attacks don’t just impact lost or stolen data, or hardware. There’s financial costs - downtime, equipment replacement costs, disruption to trading, legal implications (see more on GDPR, below), and crucially, reputational damage. Consumers are becoming more savvy to what businesses are using their personal data for, and for a data-driven organisation to experience a cyber attack could be crippling from a customer trust perspective.\n\n## GDPR & the 4%/£20,000,000 fine\n\nThe set of EU regulations known as General Data Protection Regulations (GDPR), which came into force in May 2018, has greatly increased the knock-on effect that a data breach can have on a business - of any size.\n\nThe regulations replaced the outdated Data Protection Act of 1998 which didn’t considered the rising tide of cyber attacks from 2000 onwards. One of the main features of the new regulations is the increase in fines which can be imposed on businesses responsible for data breaches or poorly handed personal data to up to £20,000,000, or 4% of a companies annual turnover, which would be crippling to an SME or startup business.\n\nThose thinking that fines won’t happen can think again - as in January 2019, Google was fined more than €50million for violating data privacy rules. It is widely expected that the effect will trickle down from larger corporations to smaller sized companies, with the number of complaints to the ICO rising 160% in the first 6 months since GDPR launched.\n\n## Average cost of cyber insurance\n\nIt’s not just huge corporations receiving fines either. An Austrian entrepreneur was fined almost €5,000 just four months after the introduction of GDPR.  Multinational law firm Freshfields Bruckhaus Deringer recently commented on this fine, which followed for violations of the GDPR. \n\nThe entrepreneur had installed a CCTV camera in front of his establishment that also recorded a large part of the sidewalk. The authorities found this act to be in violation of the GDPR, as large-scale monitoring of public spaces is not permitted under the GDPR. Apparently the camera was also not sufficiently marked as conducting video surveillance, meaning that the applicable transparency obligations had not been fulfilled.\n\nA chat platform in Germany was fined €20,000 after it reported to one of the country's data protection regulators that the personal details of over 330,000 users were compromised after a hacking incident. \n\nCyber criminals were able to access emails, passwords, real names and addresses for some users. Despite the seemingly serious nature of the breach, the regulator said the chat site had co-operated fully and implemented new measures to prevent further problems, resulting in a fairly lenient fine.\n\nIn recent larger fines, the Central Hospital of Barreiro Montijo was fined €400,000 by The Portuguese Data Protection Authority (CNPD) for allowing too many employees to access patient records. The health facility has less than 300 doctors, yet nearly 1,000 staff had the same level of access to sensitive data as medical practitioners. Doctors also allegedly had unrestricted privileges regardless of their specialty. \n\nWhile data breaches and lax IT security regarding personal data seems likely to hit the news with increasing velocity through 2019, it remains just one of the types of threat from which cyber insurance can protect your business. If you’d like to know more about the types of attack which cyber insurance can protect from, read our post here for more information on cyber insurance.\n\n## Get a cyber insurance quote today\nWith cover available from as little as £37.63 per month, Cyber Insurer UK provides an innovative insurance product which can protect your business .\n\nGet a quote today in under 60 seconds and protect your business with Cyber Insurer UK.\n"},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/RSRupsULZPQOwU6XvHVyf/ad78eb698b99c1bfe36ad2273a38d6d7/carlos-muza-84523-unsplash.jpg","fileName":"carlos-muza-84523-unsplash.jpg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"how-much-does-cyber-insurance-cost","id":"97e2c183-b893-5c07-8d0a-b7beeb58c08f"}}