{"data":{"allContentfulPost":{"edges":[{"node":{"title":"What's covered?","slug":"what-we-cover-you-for","excerpt":{"excerpt":"CyberInsurerUK gives you simple, affordable cover against the threat of Cyber attacks we do this buy providing the cover you need to put things right for you and your customers and bring in the experts you need to recover all aspects of your business quickly.\n"},"content":{"content":"## Cyber Risk Liability\n\nIf you suffer a cyber attack or a data breach this may have an effect on others. The policy will pay for defence costs and liabilities that you are liable for.\n\n## Online Media Liability\n\nIf a hacker defaces your website which means you are then infringing on others intellectual property or damage another person’s reputation, the policy will pay for defence costs and liabilities that you are liable for\n\n## Business Interruption\n\nYour IT network is at the core of your business, without it can you continue to service your clients? This policy will reimburse you for loss of income and incurred expenses if your network is hacked into.\n\n## Bricking and Data Restoration\n\nData is one of the most important assets to a company, this policy pays for recover data that has been destroyed or compromised by a cyber attack.\n\n## Cyber Extortion\n\nRansomware can not only bring your activities to a standstill but can also be a difficult situation to handle, who are the extortionists and can you pay them the ransom? This policy provides you with access to expert support and advice helping you get your data and network back from the criminals.\n\n## Cyber Crime\n\nCyber criminals ultimately want to make money, hacking into your network and diverting payments is one of the most common attacks we see. This policy reimburses you for theft of your money or property as a result of a cyber hack.\n\nData breach legal costs, Forensic costs, Public relations costs, Credit monitoring or identity costs\n\nIf you experience a data breach you will need a team to help you understand what has happened, what regulations you have breached, if any, and help to ensure your reputation is maintained with your clients. This policy provides you with access to a breach response team who can project manage the response to a data breach incident.\n\n## Regulatory Defence and Penalty Costs\n\nGDPR fines are potentially very severe, however before we even get to the fine you would have to respond to an investigation request by the Information Commissioner’s Office. This policy will provide you expert support to respond to the investigation and, to the extent insurable by law, this policy pay the consequential fines.\n\n## PCI DSS Costs\n\nIf you are accepting payment card transactions you will have signed up to maintaining the Payment Card Industry Data Security Standards. Should you experience a hack of your network which results in a cyber criminal accessing the payment card information this policy will pay costs to respond to a claim against the contract you signed with your merchant service bank and the payment card issuer.\n"},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/1GKRZd1HsLOU1SGUreAmtO/18eefdc6df15341efc21fdb1d9e335c3/oli-dale-139169-unsplash.jpg","fileName":"oli-dale-139169-unsplash.jpg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"what-we-cover-you-for","id":"317e33ad-4f6f-5b68-8b51-c691949291ef"}}