{"data":{"allContentfulPost":{"edges":[{"node":{"title":"The Insurance Baboon: Why data and algorithms are in the DNA of insurance.","slug":"the-insurance-baboon-why-data-and-algorithms-are-in-the-dna-of-insurance","excerpt":{"excerpt":"Those who know me will be able to testify to the fact that I have become obsessed with Audible audiobooks. The use of Audible has given me the chance to turn 'holiday reading' into a year-round pursuit of new literary fact and fiction.\n\nMy latest listen is 'Homo Deus, A Brief History of Tomorrow, Lessons For The 21st Century,' by Israelli Historian, Yuval Noah Harari; it is the follow up to 'Homo Sapiens' (his study of the history of humankind) and it offers a view on the human trend towards seeking immortality and how and why we've evolved to seek 'god-like' status."},"content":{"content":"At the heart of his thesis is the supposition that our evolved behaviour, including traits such as the perception of risk versus reward, fight or flight and even physical attraction is driven by algorithms - biological algorithms refined over millenias of experiences, decisions and choices made to ensure our survival and success.\n\nThe book contains different illustrations of this theory but, for me, the most entertaining one is that of the ancient baboon; more specifically, 'The Reckless Baboon & The Cautious Baboon.'\n\nThe theory goes that the ancient baboon's key daily, algorithmic function was to acquire the bananas needed to stave off hunger and grow stronger. The baboon did not have it all his own way as the ancient lion's algorithm determined that baboon meat would ensure its survival. The lion's algorithm identified that the banana tree was an ancient form of fast food drive thru: Wait there long enough and a baboon will be served up.\n\nFor the baboon, its algorithm would kick in and make a judgement, 'We see the lion, we know it is dangerous, we have to eat, the lion can't get me when I'm up the tree, can I get up in the tree and get the bananas before the lion gets me?' YES or NO. A split second decision is made.\n\nThe decision made leads to three outcomes: winning the banana, being eaten by a lion or death by starvation. 'Reckless' baboons would be eaten; 'Overly cautious' baboons would starve. Successful baboons thrived.\n\nWhichever result, the theory states that the baboons whose algorithm got it right survived and evolved and this algorithm embedded itself within baboon society forever.\n\nTo me, this makes perfect sense, but I do like to think a third baboon was also present and evolved: The 'Insurance' Baboon. Stay with me...\n\nThe 'Insurance' Baboon watched and studied the patterns of behaviour, risk, reward, success and failure and thought of different ways by which to protect and grow the baboon society. \n\nThe major thought of the insurance baboon was 'What if the reckless baboon could work with the cautious baboon to make sure there were enough bananas for all the baboons? Cautious baboons, after all, would be good at banana stock management and distribution. In a system of well managed bananas, the reckless baboon's algorithm is adapted to remove desperation from the equation, leading to better decisions and the acquisition of more bananas ultimately leading to the growth in numbers and strength of the entire baboon 'company'.\n\nStill with me…?\n\nInsurance is then, for me, an ancient algorithm designed by all life to enable growth, through risk mitigation, enabling more accumulation of resources - bananas or customers and the better distribution and deployment of these resources in order for businesses and individuals to survive and thrive.\n\nThe use of algorithms and data have always been at the centre of insurance and in today's technology-driven environment we have the ability to analyse vast amounts of data, put them into algorithms and assess the risk as quickly as the ancient baboon decided whether to go for the banana or not. \n\nThe result being better insuring decisions, the ability to provide cover much more quickly with more comfort and the ability to settle claims with less fuss. With our product, cyber insurance for small and fast growing businesses, we provide the ability to give entrepreneurs more time to focus on the accumulation of more bananas more safely. We can get you the cover you need in under five minutes.\n\nUsing information gathered from vast data sets and the many years of cyber insurance underwriting of (our partners) QBE group, CyberInsurer.UK covers entrepreneurs quickly and efficiently, on a cutting-edge online platform. We give you one less thing to worry about. \n\nTherefore, when I read an article published by the Association of British Insurers this week I was very surprised. Surprised to learn that a government report estimates that annually 60% of small businesses in the UK suffer a cyber breach or attack with an average cost to that small business of between £65,000 - £115,000. But even more concerning than this is that only 11% of UK small businesses have cyber and data breach Insurance in place. Considering that the cost to cover this level of business risk for a small business is less than £40 per month, it's no wonder the insurance baboon is concerned.\n\nSo my ask of you today is please don't be the 'reckless baboon' and think 'It will never happen to me' and please don't be the 'Over cautious' baboon and take too long to decide, please let our algorithm provide you with quick, affordable cover; let us, the 'Cyber Insurance Baboon' help you.\n\nThanks for reading.\n\nOh..\n\nI did ask our marketing people if I could change the company from CyberInsurer.UK to the 'Insurance Baboon', but they said no.\n\nCome see us at cyberinsurer.uk to see if we can help you win more bananas."},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/3ZX1xPxnUxb9Hp5YQOQIcO/225a2f8d2590773b373f41bcd28546c3/images.jpeg","fileName":"images.jpeg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"the-insurance-baboon-why-data-and-algorithms-are-in-the-dna-of-insurance","id":"bdc2bb15-d046-5bd1-bb32-7e457cb28d72"}}