{"data":{"page":{"id":"5e28bb62-c839-51c3-9a25-55389bb4a6da","html":"<p>Underwritten by the QBE Insurance Group (QBE)</p>\n<p>This insurance is an annual contract unless stated otherwise and it may be renewed at the end of each policy year on the basis of the terms and conditions applicable upon renewal. <strong>For full details of the start date and end date of the policy, you should read the policy schedule.</strong></p>\n<p>This document provides only a summary of the main benefits of your insurance policy. An outline of the policy’s significant features and benefits are set out below together with any significant exclusions or limitations. <strong>For full details of all policy benefits and all terms you should read the policy.</strong></p>\n<p>The policy is divided into a number of sections but not all the sections may be operative as part of your insurance. <strong>Please refer to your quotation or renewal documentation for confirmation of the sections of cover selected.</strong></p>\n<h2>Limit of indemnity, sub-limit of indemnity, territorial limit and jurisdictional limit</h2>\n<p>This insurance is subject to an overall limit of indemnity, as well as various limits and sub-limits of indemnity which form part of and are not in addition to the overall limit of indemnity unless stated otherwise. There are also territorial and jurisdictional limits which apply to specific sections of this policy. Please refer to your policy schedule for confirmation of the applicable limits and territorial and jurisdictional limits.</p>\n<h2>Excess or deductible</h2>\n<p>Most cover sections will carry an ‘excess’ or ‘deductible’ being the first amount of each claim or occurrence that you must pay and is not covered by your insurance. The amount(s) will be stated in your quotation or renewal documentation or in the schedule, together with a qualification whether the amount will be applied per claim or per occurrence.</p>\n<h2>Conditions</h2>\n<p>You must:</p>\n<ol>\n<li>make a fair presentation of your risk in proposing for this insurance, including making disclosure in a comprehensive and accurate manner;</li>\n<li>notify us of claims and circumstances that may become a claim as soon as practical but always within the time limitation(s) stated in the policy;</li>\n<li>notify us of any and all material changes to the declared business activity or insured risks if you require them to be covered by this insurance; and</li>\n<li>comply with the general conditions and any specific conditions designed to reduce the risk of loss.</li>\n</ol>\n<h1>Section 1A: Insuring agreements</h1>\n<h2>Cyber risk liability</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for any claim and defence costs first made against you during the policy period which arise out of any actual or alleged cyber risk of which you first becomes aware during the policy period.</p>\n<h2>Online media liability</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for any media claim and defence costs first made against you during the policy period of which you first becomes aware during the policy period.</p>\n<h2>Business Interruption</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for loss of business income incurred by you during the period of reinstatement as a result of a failure by you or service provider to protect against a breach of network.</p>\n<h2>Bricking and Data restoration</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for cost and expenses incurred in repairing, replacing or restoring electronic data and affected hardware discovered by you to be lost, damaged or destroyed.</p>\n<h2>Cyber extortion</h2>\n<p><strong>Significant features and benefits</strong>\nTo the extent insurable by law, the policy provides indemnity for cyber extortion expenses arising from cyber extortion threat during the policy period.</p>\n<h2>Cyber crime</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for theft of your money or property directly caused by a breach of network security</p>\n<h1>Section 1B: Costs</h1>\n<h2>Data breach legal costs</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for legal expenses and data breach notification costs arising out of an actual or suspected cyber risk of which you first becomes aware during the policy period.</p>\n<h2>Forensic costs</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for forensic costs incurred by a forensic consultant as a result of a cyber risk or cyber extortion threat of which you first becomes aware during the policy period.</p>\n<h2>Public relations costs</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for a panel adviser public relations and crisis management consultant to avert or mitigate any significant damage to any of your brands and business operations resulting from a cyber risk of which you first becomes aware during the policy period.</p>\n<h2>Credit monitoring or identity and penalty costs</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for the cost of offering credit monitoring or identity theft services you incur for a maximum period of twelve (12) months to those affected by a breach of privacy of which you first become aware during the policy period.</p>\n<h2>Regulatory Defence and Penalty costs</h2>\n<p><strong>Significant features and benefits</strong>\nTo the extent insurable by law, the policy provides indemnity for those amounts which you are legally obliged to pay as a result of a breach of privacy or breach of data protection law for any legal and investigation costs, as a result of a civil regulatory action, regulatory compensation award, civil penalty or fines imposed by a data protection regulator against you.</p>\n<h2>PCI DSS costs</h2>\n<p><strong>Significant features and benefits</strong>\nThe policy provides indemnity for costs you incur for a claim and defence costs first made against you by a Payment Card Entity, or a party to whom you are liable for the claim arising from a breach of privacy during the policy period.</p>\n<h2>Significant or unusual exclusions or limitations for Section 1A: Insuring agreements and Section 1B: Costs</h2>\n<p>CyberInsUK/QBE shall have no liability to make payments under the policy directly or indirectly attributable to any:</p>\n<ol>\n<li>costs in repairing, replacing or restoring your computer system to a level beyond that which existed prior to any claim or loss;</li>\n<li>bodily injury or physical loss, destruction or damage of tangible property;</li>\n<li>breach of taxation, competition, restraint of trade, anti-trust or unsolicited communications legislation or regulation;</li>\n<li>claim brought directly or indirectly by or on behalf of any insured or the insured’s parent or subsidiary or any entity in which the insured or the insured’s director(s) or officer(s), partner or member has an executive interest or responsibility or has a shareholding or other financial interest representing more than 15% of the issued share capital;</li>\n<li>dishonest or fraudulent act or omission of the insured or any deliberate or reckless breach by the insured of any law or regulation;</li>\n<li>liability arising under a contract except to the extent that such liability would have attached in the absence of such contract provided that this exclusion shall not apply in respect of PCI DSS;</li>\n<li>occurrence prior to the retroactive date or notified any other insurer(s) covering the same subject matter as the policy for a preceding policy period;</li>\n<li>false advertising or deceptive trade practices arising from media content;</li>\n<li>fines and penalties;</li>\n<li>use or provision of any gaming, gambling or lottery;</li>\n<li>confiscation, commandeering, requisition, destruction of or damage to a computer system or personally identifiable information by a government or public authority;</li>\n<li>Inaccurate pricing of goods, products or services;</li>\n<li>your insolvency;</li>\n<li>liability arising out of employment;</li>\n<li>personal liability incurred by you in the role of the director or officer;</li>\n<li>natural perils;</li>\n<li>nuclear risks and ionising radiation;</li>\n<li>the infringement of any patent or unauthorised use of trade secrets;</li>\n<li>you acting as a trustee, fiduciary or administrator of your own pension, profit sharing or employee benefits programme;</li>\n<li>claim directly or indirectly caused by pollution, asbestos or electronic fields;</li>\n<li>goods or products sold, supplied, repaired, altered, treated, manufactured, installed or maintained by you or on your behalf;</li>\n<li>return of fees or commissions;</li>\n<li>sanction, prohibition or restriction under United Nations resolutions or the trade or economic sanctions, laws or regulations of any country;</li>\n<li>claim or loss sustained by you or a third party by the transfer of money or securities;</li>\n<li>your trading loss and liabilities;</li>\n<li>use by you of software in breach of any intellectual property rights of another party;</li>\n<li>claim involving software which is no longer supported by the producer of the software and where security updates are no longer being provided;</li>\n<li>failure of an internet, telecommunications or electricity provider or other utility provider; and</li>\n<li>bodily injury, damage, claim, loss, liability, expenses, costs or defence costs caused by war or terrorism.</li>\n</ol>\n<h2>Important information</h2>\n<p><strong>Insurance Act 2015</strong>\nThis policy has been amended to take account of the provisions of the Insurance Act 2015, and is intended to comply with them, unless otherwise stated by way of endorsement or in the schedule.</p>\n<p><strong>Your right to cancel</strong>\nPlease ensure that the policy is suitable for your requirements since there are no rights of cancellation on your part. QBE may issue 30 days written notice of cancellation at any time by writing to your last known address when we will allow a pro rata refund of premium.</p>\n<p><strong>Renewing your policy</strong>\nIf QBE are willing to invite renewal of the policy QBE will use best endeavours to tell you at least 21 days before the expiry of the policy the premium and terms and conditions which will apply for the following year.</p>\n<p><strong>Premium payment</strong>\nYou are liable to pay the premium as set out in the policy. For full details of payment of premium and the duration of payments of premium you should read the policy and the schedule.</p>\n<p><strong>Other restrictions</strong>\nCertain endorsements that might apply to your policy may restrict cover. For full details you should read the policy documentation.</p>\n<p><strong>Claim notification</strong>\nShould you wish to make a claim you must notify QBE as soon as practical on receipt of any claim, suit or becoming aware of circumstances that is likely to lead to a claim. But please read your policy as specific time limits may apply for claim notification. You may contact QBE at the address shown below. In addition, immediately upon discovery of an actual or alleged cyber event, you should contact the Panel Adviser 24-hour hotline using the details set out in the schedule.</p>\n<p><strong>Complaint procedure</strong>\nIf you are unhappy with the service provided for any reason or have cause for complaint you should initially contact the person who arranged the policy for you.</p>\n<p>In each case, you should quote the policy or claim reference.</p>\n<p>A summary of the insurer’s complaints handling procedure is available on request and will also be provided to you when acknowledging a complaint.</p>\n<p>If you feel that your complaint has not been satisfactorily resolved, you may contact the UK FOS to review the complaint.</p>\n<p>To be an eligible complainant, you must be:</p>\n<ol>\n<li>a consumer;</li>\n<li>a micro-enterprise – a business that has an annual turnover of under EUR2million employing fewer than ten (10) employees;</li>\n<li>a small business - a business with an annual turnover below GBP6.5million and:</li>\n<li>fewer than 50 employees; or</li>\n<li>an annual balance sheet below GBP5million; or</li>\n<li>a charity with an annual income of less than GBP6.5million; or</li>\n<li>a trustee of a trust with net assets of less than GBP5million; or</li>\n<li>a guarantor.</li>\n</ol>\n<p>If eligible, you can contact the UK FOS via its website: <a href=\"http://www.financial-ombudsman.org.uk/consumer/complaints.htm\">http://www.financial-ombudsman.org.uk/consumer/complaints.htm</a> , write to the UK FOS, Exchange Tower, London E14 9SR, or telephone 0300 123 9 123 or 0800 023 4567.\nYou must refer its complaint to the UK FOS (a) within six (6) months of the insurer’s final response letter or (b) when the insurer has failed to resolve the issue within eight (8) weeks.</p>\n<p>The UK FOS provides impartial advice free of charge and contacting them will not affect your legal rights.</p>\n<p><strong>Compensation</strong>\nCyberInsUK Ltd / QBE UK Limited are covered by the Financial Services Compensation Scheme. This provides compensation in case any of its members are unable, in specified circumstances, to meet any valid claims under their policies. Compensation for non-compulsory insurance will be paid at 90% with no upper limit and at 100% if the insurance is legally compulsory with no upper limit. Compensation is only available to commercial customers in limited circumstances\nFurther information can be obtained from QBE at the address below, or from the Financial Services Compensation Scheme at the following address: Financial Services Compensation Scheme; 10th Floor, Beaufort House, 15 St Botolph Street, London EC3A 7QU; or from their website ( <a href=\"http://www.fscs.org.uk/contact-us/\">http://www.fscs.org.uk/contact-us/</a> ).</p>\n<p>Please note that QBE Europe SA/NV is not covered by the Financial Services Compensation Scheme.</p>\n<p><strong>The law and language applicable to the policy</strong>\nThe law of England and Wales will apply to this contract unless you and the insurer agree otherwise. The language used in this policy and any communications relating to it will be English.</p>\n<p><strong>Your insurer</strong>\nYour quotation or renewal documentation will state the name of the licenced insurer within the QBE Insurance Group (QBE) that is providing your insurance cover. It will be one of or a combination of the following companies.</p>\n<p><strong>Your insurer’s Head Office</strong>\nThe insurer’s home state is Belgium and its Head Office and registered address is:\nRegentlaan 37 Boulevard du Régent, 1000 Brussels, Tel: +32 2 504 82 11 or Fax: +32 2 504 82 00.\n<a href=\"mailto:enquiries@be.qbe.com\">enquiries@be.qbe.com</a></p>","frontmatter":{"title":"Our Policy"}}},"pageContext":{"slug":"/policy/","source":"pages"}}