{"data":{"allContentfulPost":{"edges":[{"node":{"title":"What is cyber insurance?","slug":"what-is-cyber-insurance","excerpt":{"excerpt":"Cyber insurance is a relatively modern form of insurance which protects businesses and entrepreneurs from internet-based risks such as hacking, cyber fraud, data loss or destruction (among others)."},"content":{"content":"Cyber insurance is a relatively modern form of insurance which protects businesses and entrepreneurs from internet-based risks such as hacking, cyber fraud, data loss or destruction (among others).\n\nThe threat from such attacks is growing rapidly, with a [study by the government](https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/702074/Cyber_Security_Breaches_Survey_2018_-_Main_Report.pdf) showing almost half of UK business experiencing a cyber attack in the last year. Despite this, the same study shows that only 27% of businesses have a formal cyber security policy in place.\n\nCyber insurance, or cyber liability insurance is a modern form of protection, for business owners to ensure that their company is safe from such threats. Whereas insurance used to be primarily focussed on assets and liability, remote working, cloud-based software, and the world of work in the 21st century means that insurance needs are rapidly changing. \n\n## Protecting your data, your assets, and your company\n\nThe infrastructure, hardware and software we all take for granted is subject to a huge array of threats from various sources. Some of these are well-known, however hackers and those with mailcious intent now have dozens of avenues of attack. We’ve listed the most common below. \n\nhttps://quickbooks.intuit.com/r/technology-and-security/8-types-of-cyber-attacks-your-business-needs-to-avoid/\n\n## Internet fraud/theft\n\nA report by Cifas reported that 2017 saw the highest ever level of identity fraud reported by its members. It’s a global problem, with the FBI reporting over 300,000 complaints of internet fraud, including financial fraud in 2017.\nOne of the most common ways that this occurs is through password attacks. Passwords are still one of the most simplest forms of online security used, and often overlooked. Attacks can be automated (often by  ‘brute force’, computers rapidly testing thousands of passwords per second), or simple human error such as using weak passwords or physically writing down passwords for easy theft.\n\n## Extortion\n\nYour business is no doubt your lifeblood, and cyber criminals know this. While crimes against individuals often involve credit card numbers or bank details,  cyber criminals are increasingly withholding critical business information, or even trade secrets to ransom. Typically, data will be held until a fee is paid, with the threat of information being leaked or deleted unless payment is received. These payments  are often anonymously accepted through means such as cryptocurrencies, making it almost impossible to trace back to the extorter.\n\n## Viruses, Denial-of-service attacks, Malware\n\nOne of the most common cyber crimes is the distribution of viruses, malware, and other types of software which can disrupt, damage, or take hold of your hardware or software. Malware can be sneakily installed on computers through a rogue click of a banner ad, or more systematically via USB drives. Once a computer is infected, it can be controlled remotely, or leak information without the user knowing.\n\n## Phishing\n\nPhishing attacks can and do happen to anyone. A simple email from your bank or third party provider. Except it’s not from who you think, it just looks like it is. And before you know it, your personal details are sent off to \nThis can be compounded with your personal data then being extorted. Phishing is one of the largest growing areas of cyber security, with all of us still reliant on email, and some phishing attacks looking virtually identical to a genuine email we might receive from a provider.\nGDPR insurance/data breaches\nWith the rules known as general data protection regulations coming into force in May 2018, companies are now liable for up to 4% of their annual turnover if a data breach is found to be their fault. While these attacks may be more due to negligence or ignorance, a wrongdoer could also leak stolen information, with the original company being liable for the loss.\n\n## Man-in-the-Middle attacks\n\nThese can come about when accessing free/public wi-fi hotspots. If a connection isn’t secured, personal data is easily obtainable and can be intercepted by criminals. This can be made worse if malware is then installed on the target computer, collecting even more personal data. This data can then be used to steal further data, or used in phishing attack, oten without any knowledge of the target.\nAs you can see, this (certainly not exhaustive) list gives cyber criminals a myriad of options when it comes to attacking your business.\n\n## Is your business covered?\n\nIf you’re unsure about whether or not your business is safe from the threat of phishing, or if the legal ramifications of data loss has you worried, it’s likely that your business needs cyber insurance. The risk, and the price to pay is simply too high to gamble with.\n\nLuckily, cyber insurance is a product that’s very straightforward to purchase, and once covered, you need not worry about the repercussions of such attacks. With the value of cover starting at £1 million, you can be sure that your business and your assets will be safe in the event of a serious cyber threat.\n\nCyber insurance is a ‘buy and forget’ product for many, giving the peace of mind that an of the above attacks won’t bring a business to its knees. \n\n## Protect your business today\n\nIf your business isn’t protected from threats from cyber attacks, GDPR, and the emerging threats that the internet will bring in the coming years, act now.\nGet a quote and cover from Cyber Insurer UK in just minutes and protect your business.\n\n"},"cover":{"file":{"url":"//images.ctfassets.net/327toh44mjqi/2TKRX1ogycGgoQEO6G46UQ/64693da398648ed5c4a3d7a9386dfe42/photo-1489824904134-891ab64532f1.jpg","fileName":"photo-1489824904134-891ab64532f1.jpg","contentType":"image/jpeg"}}}}]}},"pageContext":{"slug":"what-is-cyber-insurance","id":"99e9ce63-36bb-5b6a-b02f-a3be7c52cdca"}}