{"data":{"page":{"id":"38790d31-14de-52f9-85e0-808c2a7c20cc","html":"<p>You should never ever have to spend more than 10 minutes talking to insurance people, we’re really boring!</p>\n<p>Cyber Insurer UK is on a mission to make buying business cyber insurance quick, simple and pain free, so that busy people running businesses can concentrate on the big stuff, the exciting stuff and their customers and not the tedious stuff like insurance. </p>\n<p>We thought we could make insurance interesting, but we couldn’t so we’ve made it painless!</p>\n<p>If your a business with less than £2.5m in turnover we can have you covered in under five minutes, you can pay monthly with no interest or hidden charges and if you ever need to leave us it just takes two clicks and you’re done. If the worst happens and you need to make a claim we do this all over the phone to help you as quickly as we can.</p>\n<p>All documents and paperwork are stored online and available in your dashboard at anytime.</p>\n<p>So, we’re going to be safe and boring, so you don’t have to be!</p>\n<p>Cyber Insurer UK is Underwritten by the QBE Insurance Group (QBE)</p>\n<p><em>About QBE</em>: QBE European Operations is part of QBE Insurance Group, one of the world’s leading international insurers and reinsurers and Standard &#x26; Poor’s A+ rated. Listed on the Australian Securities Exchange, QBE’s gross written premium for the year ended 31 December 2018, was US$13.7 billion. As a business insurance specialist, QBE European Operations offers a range of insurance products from the standard suite of property, casualty and motor to the specialist cyber, financial lines, marine and energy. All are tailored to the individual needs of our small, medium and large customers. Our cyber team includes experienced underwriters, risk and claims managers who work with businesses to identify cyber exposures and ensure the right level of protection is in place.  We’ve also teamed up with a panel of experts to provide 24-hour support if our customers experience a cyber event. That might involve providing a forensics team to work out how the cyber breach happened and how to fix the problem; legal advice relating to fulfilling regulatory requirements; or managing a PR response to minimise any impact to reputation.</p>","frontmatter":{"title":"About Us"}}},"pageContext":{"slug":"/about/","source":"pages"}}